<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="感悟人生," />





  <link rel="alternate" href="/atom.xml" title="moexcept" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5199;&amp;#x8FD9;&amp;#x8FB9;&amp;#x6587;&amp;#x7AE0;&amp;#x6211;&amp;#x4E3B;&amp;#x8981;&amp;#x662F;&amp;#x5410;&amp;#x69FD;&amp;#xFF0C;&amp;#x9AD8;&amp;#x558A;&amp;#x4E0D;&amp;#x516C;&amp;#x3002;&amp;#x5012;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3A;&amp;#x6211;&amp;#x81EA;&amp;#x5DF1;&amp;#x611F;">
<meta property="og:type" content="article">
<meta property="og:title" content="简单的招聘方式错过了多少人才知道吗">
<meta property="og:url" content="http://codertian.com/2015/12/01/zhaopinmaimorencai/index.html">
<meta property="og:site_name" content="moexcept">
<meta property="og:description" content="&amp;#x5199;&amp;#x8FD9;&amp;#x8FB9;&amp;#x6587;&amp;#x7AE0;&amp;#x6211;&amp;#x4E3B;&amp;#x8981;&amp;#x662F;&amp;#x5410;&amp;#x69FD;&amp;#xFF0C;&amp;#x9AD8;&amp;#x558A;&amp;#x4E0D;&amp;#x516C;&amp;#x3002;&amp;#x5012;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3A;&amp;#x6211;&amp;#x81EA;&amp;#x5DF1;&amp;#x611F;">
<meta property="og:updated_time" content="2016-05-27T11:07:14.014Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="简单的招聘方式错过了多少人才知道吗">
<meta name="twitter:description" content="&amp;#x5199;&amp;#x8FD9;&amp;#x8FB9;&amp;#x6587;&amp;#x7AE0;&amp;#x6211;&amp;#x4E3B;&amp;#x8981;&amp;#x662F;&amp;#x5410;&amp;#x69FD;&amp;#xFF0C;&amp;#x9AD8;&amp;#x558A;&amp;#x4E0D;&amp;#x516C;&amp;#x3002;&amp;#x5012;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3A;&amp;#x6211;&amp;#x81EA;&amp;#x5DF1;&amp;#x611F;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'Author'
    }
  };
</script>

  <title> 简单的招聘方式错过了多少人才知道吗 | moexcept </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">moexcept</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">唯有苦，方有甜。唯有累，方有闲</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            Categories
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                简单的招聘方式错过了多少人才知道吗
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2015-12-01T01:00:58+08:00" content="2015-12-01">
              2015-12-01
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">In</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/感悟人生/" itemprop="url" rel="index">
                    <span itemprop="name">感悟人生</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2015/12/01/zhaopinmaimorencai/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2015/12/01/zhaopinmaimorencai/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><strong>&#x5199;&#x8FD9;&#x8FB9;&#x6587;&#x7AE0;&#x6211;&#x4E3B;&#x8981;&#x662F;&#x5410;&#x69FD;&#xFF0C;&#x9AD8;&#x558A;&#x4E0D;&#x516C;&#x3002;&#x5012;&#x4E0D;&#x662F;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x611F;&#x5230;&#x4E0D;&#x516C;&#xFF0C;&#x662F;&#x4E3A;&#x6574;&#x4E2A;&#x5927;&#x5B66;&#x751F;&#x611F;&#x5230;&#x4E0D;&#x516C;&#xFF0C;&#x4E3A;&#x90A3;&#x4E9B;&#x8F9B;&#x52E4;&#x4ED8;&#x51FA;&#x6700;&#x7EC8;&#x5374;&#x7EC8;&#x6CA1;&#x56DE;&#x62A5;&#x7684;&#x4EBA;&#x611F;&#x5230;&#x4E0D;&#x516C;&#xFF01;&#x540C;&#x65F6;&#x4E5F;&#x4E3A;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x611F;&#x5230;&#x53EF;&#x60B2;&#xFF0C;&#x53EF;&#x60B2;&#x4F60;&#x4EEC;&#x62DB;&#x4E0D;&#x5230;&#x4EBA;&#x624D;&#xFF0C;&#x4F60;&#x4EEC;&#x773C;&#x775B;&#x64E6;&#x4E0D;&#x4EAE;&#xFF0C;&#x4F60;&#x4EEC;&#x7684;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x5F62;&#x540C;&#x865A;&#x8BBE;&#xFF01;&#xFF01;&#xFF01;</strong></p>
<a id="more"></a>
<p>&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x53EF;&#x80FD;&#x6709;&#x516C;&#x53F8;hr&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x95E8;leader&#xFF0C;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4EBA;&#x5458;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x62DB;&#x8058;&#x8FC7;&#x6211;&#x80FD;&#x770B;&#x51FA;&#x6211;&#x662F;&#x8C01;&#xFF0C;&#x4F46;&#x8FD9;&#x90FD;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x5E73;&#x5FC3;&#x9759;&#x6C14;&#x770B;&#x5B8C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x5410;&#x69FD;&#x6211;&#xFF01;&#xFF01;&#x8C22;&#x8C22;</p>
<p>&#x73B0;&#x5728;&#x79CB;&#x5B63;&#x6821;&#x56ED;&#x62DB;&#x8058;&#x57FA;&#x672C;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x62FF;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;offer&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x5E02;&#x503C;1000&#x591A;&#x4EBF;&#x201D;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7684;offer&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x540E;&#x6211;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x53BB;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x5BB6;&#xFF0C;&#x81F3;&#x4E8E;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x53BB;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x6211;&#x4F1A;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#xFF01;</p>
<p>&#x6211;&#x62FF;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x4F5C;&#x5BF9;&#x6BD4;&#xFF0C;&#x6765;&#x6292;&#x53D1;&#x6211;&#x5FC3;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x4E0D;&#x6EE1;&#x3002;&#x963F;&#x5F25;&#x9640;&#x4F5B;&#xFF01;&#xFF01;</p>
<h3 id="&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x53BB;&#xFF1F;"><a href="#&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x53BB;&#xFF1F;" class="headerlink" title="&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x53BB;&#xFF1F;"></a>&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x53BB;&#xFF1F;</h3><p>&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x5F88;&#x6C34;&#xFF0C;&#x8BA9;&#x6211;&#x611F;&#x89C9;&#x8FDB;&#x53BB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x5751;&#xFF0C;&#x800C;&#x4E14;&#x62DB;&#x6536;&#x7684;&#x4EBA;&#x8D85;&#x7EA7;&#x591A;&#xFF0C;&#x8BA9;&#x6211;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5F88;&#x5EC9;&#x4EF7;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E0D;&#x8BE5;&#x8FD9;&#x513F;&#x8F7B;&#x677E;&#x554A;&#xFF1F;</p>
<p>&#x7B14;&#x8BD5;&#x2014;&gt;&#x4E00;&#x8F6E;&#x6280;&#x672F;&#x9762;&#x2014;&gt;HR&#x9762;</p>
<p>&#x7B14;&#x8BD5;&#x9898;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF0C;&#x505A;&#x5B8C;&#x5F53;&#x5929;&#x665A;&#x4E0A;&#x5C31;&#x901A;&#x77E5;&#x7B2C;&#x4E8C;&#x5929;&#x9762;&#x8BD5;&#xFF01;</p>
<p>&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x8BA9;&#x6211;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x95EE;&#x4E86;&#x4E00;&#x4E9B;C++,java,&#x6570;&#x636E;&#x5E93;&#xFF0C;HTTP&#x7B49;&#x77E5;&#x8BC6;&#xFF0C;&#x90FD;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x975E;&#x5E38;&#x57FA;&#x7840;&#xFF0C;&#x6CA1;&#x5565;&#x6280;&#x672F;&#x542B;&#x91CF;&#xFF0C;&#x770B;&#x4E00;&#x904D;&#x5C31;&#x80FD;&#x8BB0;&#x4F4F;&#x7684;&#x3002;&#x5173;&#x952E;&#x6211;&#x662F;&#x9762;&#x8BD5;&#x7684;iOS&#x5F00;&#x53D1;&#x7684;&#x554A;&#xFF0C;&#x6211;&#x4EA4;&#x7684;&#x7B80;&#x5386;&#x9762;&#x8BD5;&#x5B98;&#x76F4;&#x63A5;&#x5FFD;&#x7565;&#xFF0C;&#x7FFB;&#x8FC7;&#x53BB;&#x4E0D;&#x770B;&#x6211;&#x7B80;&#x5386;&#xFF0C;&#x95EE;&#x7684;&#x90FD;&#x662F;&#x4ED6;&#x81EA;&#x5DF1;&#x51C6;&#x5907;&#x597D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x9762;&#x8BD5;&#x5B8C;&#x5C31;&#x8BA9;&#x6211;&#x53C2;&#x52A0;HR&#x9762;&#x4E86;&#x3002;</p>
<p>HR&#x9762;&#xFF0C;&#x95EE;&#x4E86;&#x4E00;&#x4E9B;&#x5BB6;&#x5EAD;&#x60C5;&#x51B5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;iOS&#x5F00;&#x53D1;&#x7B49;&#x95EE;&#x9898;&#xFF0C;OK&#x4E86;&#x3002;&#x987A;&#x5229;&#x62FF;&#x5230;offer&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x4ECE;&#x6CA1;&#x611F;&#x89C9;&#x5230;&#x8FDB;&#x4E00;&#x5BB6;&#x5E02;&#x503C;1000&#x4EBF;&#x7684;&#x516C;&#x53F8;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x7ED9;&#x4F60;&#x4F60;&#x6562;&#x8FDB;&#x5417;&#xFF1F;&#xFF1F;&#xFF1F;</p>
<p><strong>&#x66F4;&#x53EF;&#x7B11;&#x7684;&#x662F;</strong></p>
<p>&#x6211;&#x4E00;&#x57FA;&#x53CB;&#xFF0C;&#x77E5;&#x9053;&#x6211;&#x9762;&#x8BD5;&#x65F6;&#x5199;&#x7684;&#x662F;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x544A;&#x8BC9;&#x4E86;&#x4ED6;&#x5BA4;&#x53CB;&#xFF0C;&#x4ED6;&#x5BA4;&#x53CB;&#x8D76;&#x7D27;&#x8FDB;&#x767E;&#x5EA6;&#x641C;&#x4E00;&#x4E0B;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x53C2;&#x52A0;&#x9762;&#x8BD5;&#xFF0C;&#x8C01;&#x77E5;&#x9053;&#x9762;&#x8BD5;&#x5B98;&#x6B63;&#x597D;&#x8BA9;&#x4ED6;&#x5199;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x540E;&#x6765;&#x4E5F;&#x62FF;&#x5230;&#x4E86;offer&#xFF0C;&#x8FD9;&#x5C82;&#x4E0D;&#x662F;&#x5076;&#x7136;&#x6027;&#xFF0C;&#x8FD0;&#x6C14;&#x6027;&#x5F88;&#x5F3A;&#xFF1F;&#xFF1F;&#xFF1F;&#xFF1F;</p>
<p><strong>&#x7136;&#x800C;</strong></p>
<p>&#x6211;&#x4E00;&#x540C;&#x73ED;&#x540C;&#x5B66;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E13;&#x4E1A;&#x516C;&#x8BA4;&#x7684;&#x5927;&#x795E;&#x7EA7;&#x4EBA;&#x7269;&#xFF0C;&#x5927;&#x4E00;&#x5C31;&#x53C2;&#x52A0;ACM&#x7ADE;&#x8D5B;&#xFF0C;&#x62FF;&#x5230;&#x4E86;&#x5357;&#x4EAC;&#x67D0;&#x77E5;&#x540D;&#x4F01;&#x4E1A;offer&#x4F46;&#x6CA1;&#x53BB;&#xFF0C;&#x6280;&#x672F;&#x7EDD;&#x5BF9;&#x6BD4;&#x6211;&#x5F3A;&#xFF0C;&#x4E00;&#x76F4;&#x662F;&#x6211;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x95EE;&#x9898;&#x7ED9;pass&#x4E86;&#xFF0C;&#x771F;&#x5FC3;&#x8BA9;&#x6211;&#x4E3A;&#x8FD9;&#x4E2A;&#x4F01;&#x4E1A;&#x611F;&#x5230;&#x9057;&#x61BE;&#x3002;&#x5982;&#x6B64;&#x4EBA;&#x624D;&#x5374;&#x56E0;&#x4E3A;&#x4E00;&#x70B9;&#x5931;&#x8BEF;&#x800C;&#x653E;&#x8D70;&#x3002;</p>
<p><strong>&#x4EE5;&#x4E0A;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;</strong></p>
<p>&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x4F60;&#x4EEC;&#x8FD9;&#x6837;&#x5B50;&#x62DB;&#x4EBA;&#x624D;&#x771F;&#x7684;&#x80FD;&#x62DB;&#x5230;&#x597D;&#x7684;&#x4EBA;&#x624D;&#x5417;&#xFF1F;&#xFF1F;&#x4F60;&#x4EEC;&#x4FDD;&#x8BC1;&#x4F60;&#x4EEC;&#x62DB;&#x7684;&#x4EBA;&#x624D;&#x90FD;&#x662F;&#x8D27;&#x771F;&#x4EF7;&#x5B9E;&#x5417;&#xFF1F;&#x4F60;&#x4EEC;&#x5BF9;&#x4EBA;&#x624D;&#x771F;&#x7684;&#x91CD;&#x89C6;&#x5417;&#xFF1F;&#xFF1F;</p>
<p>&#x4E00;&#x6B21;&#x6280;&#x672F;&#x9762;&#x8BD5;&#x5C31;&#x80FD;&#x65AD;&#x5B9A;&#x4E00;&#x4E2A;&#x4EBA;&#x9002;&#x4E0D;&#x9002;&#x5408;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#x662F;&#x4E0D;&#x662F;&#x672A;&#x514D;&#x592A;&#x8349;&#x7387;&#x4E86;&#x5427;&#xFF1F;&#xFF1F;&#x50CF;&#x6211;&#x6240;&#x77E5;&#x9053;&#x7684;&#x540D;&#x4F01;&#x4E0D;&#x90FD;&#x662F;&#x4E24;&#x6B21;&#x6280;&#x672F;&#x9762;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x5417;&#xFF1F;&#x611F;&#x89C9;&#x4F60;&#x4EEC;&#x8FD9;&#x6837;&#x4E0D;&#x4EC5;&#x662F;&#x5BF9;&#x4F01;&#x4E1A;&#x4E0D;&#x8D1F;&#x8D23;&#xFF0C;&#x4E5F;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x624D;&#x4E0D;&#x8D1F;&#x8D23;&#x5427;&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EBA;&#x6211;&#x540C;&#x5B66;&#xFF0C;&#x522B;&#x7684;&#x73ED;&#x7684;&#xFF0C;&#x5E73;&#x5E38;&#x5C31;&#x662F;&#x641E;&#x7B97;&#x6CD5;&#x7684;&#xFF0C;&#x7B97;&#x6CD5;6&#x7684;&#x8981;&#x6B7B;&#xFF0C;&#x7EFC;&#x5408;&#x5B9E;&#x529B;&#x7EDD;&#x5BF9;&#x725B;&#x903C;&#xFF0C;&#x6280;&#x672F;&#x7EDD;&#x5BF9;&#x4E5F;&#x5728;&#x6211;&#x4E4B;&#x4E0A;&#xFF0C;&#x5C31;&#x56E0;&#x4E3A;&#x7B14;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x600E;&#x4E48;&#x4F1A;Java&#xFF0C;&#x5BFC;&#x81F4;&#x9519;&#x8FC7;&#x4E86;&#x5357;&#x4EAC;&#x4E00;&#x5BB6;&#x6709;&#x540D;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x7B7E;&#x4E86;&#x4E00;&#x5BB6;&#x5916;&#x5305;&#x516C;&#x53F8;&#xFF0C;&#x8FD9;&#x662F;&#x591A;&#x4E48;&#x7684;&#x53EF;&#x60B2;&#xFF0C;&#x53EF;&#x53F9;&#xFF0C;&#x6211;&#x90FD;&#x66FF;&#x4ED6;&#x611F;&#x5230;&#x4E0D;&#x5E73;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x7684;&#x7B14;&#x8BD5;&#x662F;&#x51E0;&#x767E;&#x9053;&#x884C;&#x6D4B;&#x9898;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#x4F60;&#x4EEC;&#x62DB;&#x7A0B;&#x5E8F;&#x5458;&#x641E;&#x8FD9;&#x4E1C;&#x897F;&#x6709;&#x5565;&#x7528;&#xFF1F;&#xFF1F;&#x96BE;&#x9053;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5929;&#x5929;&#x5BF9;&#x7740;&#x7535;&#x8111;&#x7814;&#x7A76;&#x201C;&#x8FD9;&#x51E0;&#x4E2A;&#x6570;&#x89C4;&#x5F8B;&#x662F;&#x5565;&#x201D;&#xFF0C;&#x201C;&#x8FD9;&#x4E2A;&#x56FE;&#x5F62;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x5565;&#x201D;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF1F;&#xFF1F;&#xFF1F;</p>
<p>&#x6211;&#x56FA;&#x7136;&#x77E5;&#x9053;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x662F;&#x8981;&#x90A3;&#x4E9B;&#x57FA;&#x7840;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7B97;&#x6CD5;&#x5565;&#x7684;&#x5FC5;&#x987B;&#x8981;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x80CC;&#x7684;&#x554A;&#xFF01;&#xFF01;&#x4FD7;&#x8BDD;&#x8BF4;&#xFF1A;&#x201C;&#x4E34;&#x9635;&#x78E8;&#x67AA;&#xFF0C;&#x4E0D;&#x5FEB;&#x4E5F;&#x5149;&#x201D;&#xFF0C;&#x9762;&#x8BD5;&#x524D;&#x7FFB;&#x4E00;&#x4E0B;&#xFF0C;&#x7A0D;&#x5FAE;&#x8111;&#x5B50;&#x91CC;&#x6709;&#x70B9;&#x5370;&#x8C61;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x8BF4;&#x51FA;&#x6765;&#x5C31;OK&#x4E86;&#x3002;&#x4E70;&#x672C;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x9762;&#x8BD5;&#x5B9D;&#x5178;&#x300B;&#x4E0A;&#x9762;&#x5168;&#x90E8;&#x90FD;&#x6709;&#x554A;&#xFF01;&#xFF01;&#x9762;&#x8BD5;&#x4E00;&#x5473;&#x95EE;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x4E5F;&#x662F;&#x4F53;&#x73B0;&#x4E0D;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x771F;&#x5B9E;&#x6C34;&#x5E73;&#x7684;&#x554A;&#xFF01;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x60F3;&#x8981;&#x62DB;&#x4E00;&#x4E2A;&#x4EBA;&#x624D;&#xFF0C;&#x4E0D;&#x80FD;&#x53EA;&#x770B;&#x4ED6;&#x7B14;&#x8BD5;&#x548C;&#x9762;&#x8BD5;&#x65F6;&#x5BF9;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x56DE;&#x7B54;&#xFF0C;&#x5C31;&#x80FD;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x4EBA;&#x9002;&#x4E0D;&#x9002;&#x5408;&#x4F01;&#x4E1A;&#x3002;&#x4F60;&#x8981;&#x4ECE;&#x66F4;&#x591A;&#x7684;&#x65B9;&#x9762;&#x662F;&#x770B;&#xFF0C;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x57F9;&#x517B;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x6211;&#x611F;&#x89C9;&#x62DB;&#x6536;&#x4EBA;&#x624D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x53EF;&#x4EE5;&#x8BA9;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x501F;&#x9274;&#x7684;&#x3002;</p>
<h3 id="&#x8FD9;&#x662F;&#x6211;&#x53E6;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x7ECF;&#x5386;"><a href="#&#x8FD9;&#x662F;&#x6211;&#x53E6;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x7ECF;&#x5386;" class="headerlink" title="&#x8FD9;&#x662F;&#x6211;&#x53E6;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x7ECF;&#x5386;"></a>&#x8FD9;&#x662F;&#x6211;&#x53E6;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x7ECF;&#x5386;</h3><p>&#x5BA3;&#x8BB2;&#x4F1A;&#x2014;&gt;&#x6295;&#x7B80;&#x5386;(&#x7B80;&#x5386;&#x7B5B;&#x9009;)&#x2014;&gt;&#x521D;&#x9762; &#x2014;&gt; &#x90E8;&#x95E8;&#x6280;&#x672F;&#x4E3B;&#x7BA1;&#x51FA;&#x9898;&#x7B14;&#x8BD5; &#x2014;&gt;&#x6280;&#x672F;&#x4E3B;&#x7BA1;&#x590D;&#x8BD5; &#x2014;&gt; hr&#x8C08;offer</p>
<p>&#x521D;&#x9762;&#xFF1A;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x4E86;&#x6211;&#x4E00;&#x4E2A;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x201C;&#x7ED9;&#x4E00;&#x767E;&#x4E2A;&#x6570;&#x8BA9;&#x6211;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x6392;&#x5E8F;&#xFF0C;&#x8BA9;&#x6211;&#x9009;&#x62E9;&#x4EC0;&#x4E48;&#x7B97;&#x6CD5;&#xFF1F;&#x201D;&#x6211;&#x8BF4;&#x6211;&#x4F1A;&#x9009;&#x62E9;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x4E86;&#x4E00;&#x904D;&#x5FEB;&#x8BFB;&#x6392;&#x5E8F;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x53C8;&#x8BF4;&#x201C;&#x5982;&#x679C;&#x7ED9;&#x4F60;&#x4E00;&#x5343;&#x4E2A;&#xFF0C;&#x4E00;&#x4E07;&#x4E2A;&#x6570;&#x5462;&#x201D;&#x6211;&#x77AC;&#x95F4;&#x50BB;&#x773C;&#x4E86;&#xFF0C;&#x8FD9;&#x6839;&#x672C;&#x6CA1;&#x6CD5;&#x9009;&#x62E9;&#x554A;&#xFF0C;&#x4E00;&#x65F6;&#x4E0D;&#x77E5;&#x600E;&#x4E48;&#x8A00;&#x8BED;&#xFF0C;&#x611F;&#x89C9;&#x521D;&#x9762;&#x5C31;&#x8981;&#x8DEA;&#x7684;&#x8282;&#x594F;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x6211;&#x9047;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x74F6;&#x9888;&#x8BF4;&#x51FA;&#x6765;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8BF4;&#x201C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E48;&#x591A;&#x6570;&#x600E;&#x4E48;&#x5728;&#x90A3;&#x653E;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x5927;&#x6570;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x591A;&#x5C0F;&#x6570;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4E2D;&#x95F4;&#x6709;&#x4E9B;&#x6392;&#x597D;&#x7684;&#x6570;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x8BA9;&#x6211;&#x5F88;&#x96BE;&#x9009;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x9009;&#x54EA;&#x4E2A;&#x201D;&#xFF01;&#xFF01;&#x9762;&#x8BD5;&#x5B98;&#x8BF4;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8981;&#x6211;&#x8FD9;&#x601D;&#x60F3;&#xFF0C;&#x4E0D;&#x80FD;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#x8BFE;&#x672C;&#x4E0A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8981;&#x61C2;&#x5F97;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x505A;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x8981;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x800C;&#x5B9A;&#xFF01;&#xFF01;&#x6211;&#x7684;&#x521D;&#x9762;&#x987A;&#x5229;&#x901A;&#x8FC7;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x662F;&#x4E0D;&#x662F;&#x611F;&#x89C9;&#x6BD4;&#x90A3;&#x4E9B;&#x5355;&#x7EAF;&#x95EE;&#x7B97;&#x6CD5;&#x597D;&#x591A;&#x4E86;&#x5462;&#xFF1F;&#xFF1F;&#xFF1F;&#xFF1F;&#x8FD9;&#x540C;&#x65F6;&#x4E5F;&#x8003;&#x5BDF;&#x4E86;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x554A;&#xFF01;&#xFF01;</p>
<p>&#x7B14;&#x8BD5;&#xFF1A;&#x8FD9;&#x4E2A;&#x7B14;&#x8BD5;&#x53C8;&#x4E00;&#x6B21;&#x8BA9;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4E0D;&#x540C;&#xFF0C;&#x548C;&#x4EE5;&#x5F80;&#x7684;&#x7B14;&#x8BD5;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x76F4;&#x63A5;&#x90AE;&#x7BB1;&#x53D1;&#x4E86;&#x4E00;&#x4EFD;word&#x6587;&#x6863;&#xFF0C;&#x6211;&#x8FD8;&#x5929;&#x771F;&#x7684;&#x4EE5;&#x4E3A;&#x8FD9;&#x7B14;&#x8BD5;&#x9898;&#x76F4;&#x63A5;&#x767E;&#x5EA6;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x8981;&#x6B7B;&#x554A;&#x3002;&#x7B49;&#x6211;&#x771F;&#x6B63;&#x505A;&#x4E86;&#x8FD9;&#x4E09;&#x9053;&#x9898;&#x7684;&#x65F6;&#x5019;&#x6211;&#x624D;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x51FA;&#x9898;&#x4EBA;&#x5C31;&#x662F;&#x8981;&#x6211;&#x767E;&#x5EA6;&#x7684;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x9053;&#x9898;&#x7ED9;&#x6211;&#x4E86;&#x4E09;&#x7BC7;&#x82F1;&#x6587;&#x53C2;&#x8003;&#x6587;&#x6863;&#x5173;&#x4E8E;MVVM&#x6A21;&#x5F0F;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x5199;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;MVVM&#x6A21;&#x5F0F;demo&#xFF0C;&#x7136;&#x540E;&#x4E0A;&#x4F20;github&#x3002;&#x6211;&#x5F53;&#x7136;&#x6CA1;&#x542C;&#x8FC7;MVVM&#x6A21;&#x5F0F;&#x4E86;&#xFF0C;&#x4E5F;&#x662F;&#x90A3;&#x65F6;&#x5019;&#x624D;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x660E;&#x767D;&#x4EE5;&#x540E;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x57FA;&#x4E8E;MVVM&#x6A21;&#x5F0F;&#x7684;&#x9910;&#x5385;demo&#xFF0C;&#x6BCF;&#x4E00;&#x9898;&#x6211;&#x90FD;&#x628A;demo&#x4E0A;&#x4F20;github&#xFF0C;&#x7136;&#x540E;&#x505A;&#x4E86;&#x8BB2;&#x89E3;&#xFF0C;&#x8FD8;&#x914D;&#x4E86;gif&#x56FE;&#x7247;&#xFF0C;&#x987A;&#x5229;&#x8FC7;&#x4E86;&#x7B14;&#x8BD5;&#x3002;</p>
<p>&#x4F01;&#x4E1A;&#x62DB;&#x4E00;&#x4E2A;&#x4EBA;&#x624D;&#x8981;&#x8003;&#x5BDF;&#x4ED6;&#x7684;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x6B21;&#x7B14;&#x8BD5;&#x5C31;&#x8BF4;&#x660E;&#x4E86;</p>
<ol>
<li>&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x81EA;&#x5B66;&#x80FD;&#x529B;&#xFF0C;&#x82F1;&#x6587;&#x9605;&#x8BFB;&#x80FD;&#x529B;&#x4EE5;&#x53CA;&#x5BF9;&#x4E8B;&#x7269;&#x7684;&#x5438;&#x6536;&#x80FD;&#x529B;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#xFF0C;&#x770B;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x5982;&#x4F55;&#x5C31;&#x770B;&#x4ED6;&#x7684;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x5982;&#x4F55;&#xFF0C;&#x770B;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x770B;&#x51FA;&#x4ED6;&#x7684;&#x6C34;&#x5E73;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E8B;&#x7684;&#x6001;&#x5EA6;&#x662F;&#x4E0D;&#x662F;&#x8BA4;&#x771F;&#x3002;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x90FD;&#x8981;&#x8BA4;&#x771F;&#x5BF9;&#x5F85;&#x3002;</li>
</ol>
<p>&#x6280;&#x672F;&#x590D;&#x8BD5;&#xFF1A;&#x516C;&#x53F8;iOS&#x5F00;&#x53D1;&#x90E8;&#x7684;leader&#x4EB2;&#x81EA;&#x9762;&#x8BD5;&#x6211;&#xFF0C;&#x8DDF;&#x6211;&#x63A2;&#x8BA8;&#x7B14;&#x8BD5;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x70B9;&#xFF0C;&#x8C08;&#x4E00;&#x4E0B;&#x6211;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4ED6;&#x4F1A;&#x7ED9;&#x6211;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x6211;&#x6CA1;&#x7406;&#x89E3;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x6821;&#x5E94;&#x5C4A;&#x751F;&#x5F88;&#x96BE;&#x6709;&#x4EC0;&#x4E48;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#xFF0C;&#x6240;&#x4EE5;&#x9879;&#x76EE;&#x4F1A;&#x8C08;&#x7684;&#x5F88;&#x5C11;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5B66;&#x6821;&#x672C;&#x5C97;&#x4F4D;&#x7684;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x8D70;&#x5230;&#x4E86;&#x6700;&#x540E;&#x3002;&#x62FF;&#x5230;&#x4E86;offer&#x3002;</p>
<p>&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;offer&#x62FF;&#x7684;&#x771F;&#x4E0D;&#x5BB9;&#x6613;&#x554A;&#xFF01;&#x4E5F;&#x8BA9;&#x6211;&#x500D;&#x52A0;&#x73CD;&#x60DC;&#x3002;&#x8BA9;&#x6211;&#x611F;&#x53D7;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x611F;&#x53D7;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x611F;&#x89C9;&#x5230;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x4E13;&#x4E1A;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x4EBA;&#x624D;&#x7684;&#x82DB;&#x523B;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><strong>&#x90A3;&#x4E48;&#x4E00;&#x5BF9;&#x6BD4;&#x4F60;&#x5C31;&#x5C31;&#x6709;&#x7591;&#x95EE;&#x4E86;&#xFF1A;</strong></p>
<p>&#x90A3;&#x4E9B;&#x968F;&#x4FBF;&#x9762;&#x9762;&#x5C31;&#x7ED9;offer&#x7684;&#x516C;&#x53F8;&#x4F60;&#x4EEC;&#x771F;&#x7684;&#x662F;&#x5728;&#x62DB;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5417;&#xFF1F;&#xFF1F;&#x771F;&#x7684;&#x662F;&#x5728;&#x62DB;&#x4EBA;&#x624D;&#x5417;&#xFF1F;&#xFF1F;&#x8FD8;&#x662F;&#x53EA;&#x662F;&#x5728;&#x62DB;&#x7801;&#x519C;&#x5B8C;&#x6210;&#x62DB;&#x8058;&#x4EFB;&#x52A1;&#xFF1F;&#xFF1F;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x4ECE;&#x767E;&#x5EA6;&#x4E0A;&#x770B;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4ECE;&#x4F60;&#x4EEC;&#x7684;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#x770B;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#xFF0C;&#x62DB;&#x8058;&#x6C34;&#x4E0D;&#x6C34;&#x7EDD;&#x5BF9;&#x5F71;&#x54CD;&#x4E00;&#x4E9B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x60F3;&#x591A;&#x62DB;&#x4EBA;&#x5C31;&#x628A;&#x62DB;&#x8058;&#x6761;&#x4EF6;&#x653E;&#x90A3;&#x4E48;&#x4F4E;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x62C9;&#x4F4E;&#x4F01;&#x4E1A;&#x5728;&#x6211;&#x4EEC;&#x5FC3;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6700;&#x4E25;&#x91CD;&#x7684;&#x5C31;&#x662F;&#x57CB;&#x6CA1;&#x201C;&#x4EBA;&#x624D;&#x201D;&#x6536;&#x8D70;&#x201C;&#x6C34;&#x624D;&#x201D;&#xFF01;</p>
<h3 id="&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6821;&#x62DB;&#x4EBA;&#x624D;&#x91CD;&#x8981;&#x7684;&#x662F;"><a href="#&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6821;&#x62DB;&#x4EBA;&#x624D;&#x91CD;&#x8981;&#x7684;&#x662F;" class="headerlink" title="&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6821;&#x62DB;&#x4EBA;&#x624D;&#x91CD;&#x8981;&#x7684;&#x662F;"></a>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6821;&#x62DB;&#x4EBA;&#x624D;&#x91CD;&#x8981;&#x7684;&#x662F;</h3><ul>
<li>&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x57F9;&#x517B;&#x7684;&#x4EBA;&#x624D;&#xFF1F;</li>
<li>&#x505A;&#x4E8B;&#x662F;&#x4E0D;&#x662F;&#x8BA4;&#x771F;&#xFF1F;</li>
<li>&#x81EA;&#x5B66;&#x80FD;&#x529B;&#x4E0E;&#x5206;&#x6790;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x5982;&#x4F55;&#xFF1F;</li>
<li>&#x6709;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7279;&#x7684;&#x60F3;&#x6CD5;&#xFF1F;</li>
<li>&#x5E73;&#x5E38;&#x662F;&#x600E;&#x4E48;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#xFF1F;&#x6BD4;&#x5982;&#x8BFB;&#x6E90;&#x7801;&#xFF0C;&#x901B;github&#xFF0C;&#x901B;stackoverflow&#x7B49;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x62DB;&#x4EBA;&#x624D;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x4F60;&#x5BA1;&#x89C6;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x516C;&#x53F8;&#x7684;&#x62DB;&#x8058;&#x6D41;&#x7A0B;&#xFF0C;<strong>&#x7ED9;&#x771F;&#x4EBA;&#x624D;&#x4E00;&#x4E2A;&#x673A;&#x4F1A;&#xFF0C;&#x8BA9;&#x516C;&#x53F8;&#x5C11;&#x4E00;&#x4E9B;&#x540E;&#x6094;</strong>&#xFF0C;&#x4E0D;&#x8981;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x62DB;&#x8058;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x5FD8;&#x8BB0;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x5B97;&#x65E8;&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x8BF7;&#x4F60;&#x4EEC;&#x7ED9;&#x90A3;&#x4E9B;&#x6709;&#x771F;&#x6C34;&#x5E73;&#x7684;&#x4EBA;&#x4E00;&#x4E9B;&#x673A;&#x4F1A;&#x5427;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x6709;&#x6C34;&#x5E73;&#x7684;&#x9762;&#x8BD5;&#x8BC1;&#x660E;&#x4ED6;&#x81EA;&#x5DF1;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x4F60;&#x4EEC;&#x4ECE;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E0C;&#x671B;&#x9047;&#x89C1;&#x771F;&#x4F2F;&#x4E50;&#x554A;&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x4EE5;&#x4E0A;&#x89C2;&#x70B9;&#x5982;&#x6709;&#x523A;&#x75DB;&#x4F60;&#x7684;&#x5FC3;&#xFF0C;&#x8BF7;&#x7A0D;&#x5B89;&#x52FF;&#x8E81;&#xFF0C;&#x53EF;&#x4EE5;&#x7559;&#x8A00;&#x55B7;&#x6211;&#xFF01;&#x1F601;&#x1F601;&#x1F601;&#x1F601;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/感悟人生/" rel="tag">#感悟人生</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/11/29/what-let-me-abandon-Java-turn-to-iOS/" rel="next" title="是什么让我放弃了Java走向iOS开发">
                <i class="fa fa-chevron-left"></i> 是什么让我放弃了Java走向iOS开发
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/12/07/github-zhang-hao-shen-ru-ji-qie-huan/" rel="prev" title="github账号切换以及https和SSH上传方式对比">
                github账号切换以及https和SSH上传方式对比 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2015/12/01/zhaopinmaimorencai/"
           data-title="简单的招聘方式错过了多少人才知道吗" data-url="http://codertian.com/2015/12/01/zhaopinmaimorencai/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="John Doe" />
          <p class="site-author-name" itemprop="name">John Doe</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">posts</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">categories</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#我为什么没有去？"><span class="nav-number">1.</span> <span class="nav-text">我为什么没有去？</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#这是我另一家公司的面试经历"><span class="nav-number">2.</span> <span class="nav-text">这是我另一家公司的面试经历</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#总结一下，我认为校招人才重要的是"><span class="nav-number">3.</span> <span class="nav-text">总结一下，我认为校招人才重要的是</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">John Doe</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"moexcept"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
