<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="iOS,感悟人生," />





  <link rel="alternate" href="/atom.xml" title="moexcept" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x4F60;&amp;#x8981;&amp;#x505A;iOS&amp;#x5F00;&amp;#x53D1;&amp;#xFF1F;
&amp;#x5982;&amp;#x679C;&amp;#x628A;&amp;#x4F60;&amp;#x62DB;&amp;#x8FDB;&amp;#x6765;&amp;#x8981;&amp;#x8BA9;&amp;#x4F60;&amp;#x505A;Java&amp;#x6216;&amp;#x8005;.net&amp;#x5F00;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="是什么让我放弃了Java走向iOS开发">
<meta property="og:url" content="http://codertian.com/2015/11/29/what-let-me-abandon-Java-turn-to-iOS/index.html">
<meta property="og:site_name" content="moexcept">
<meta property="og:description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x4F60;&amp;#x8981;&amp;#x505A;iOS&amp;#x5F00;&amp;#x53D1;&amp;#xFF1F;
&amp;#x5982;&amp;#x679C;&amp;#x628A;&amp;#x4F60;&amp;#x62DB;&amp;#x8FDB;&amp;#x6765;&amp;#x8981;&amp;#x8BA9;&amp;#x4F60;&amp;#x505A;Java&amp;#x6216;&amp;#x8005;.net&amp;#x5F00;&amp;#x">
<meta property="og:updated_time" content="2016-05-27T11:07:14.013Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="是什么让我放弃了Java走向iOS开发">
<meta name="twitter:description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x4F60;&amp;#x8981;&amp;#x505A;iOS&amp;#x5F00;&amp;#x53D1;&amp;#xFF1F;
&amp;#x5982;&amp;#x679C;&amp;#x628A;&amp;#x4F60;&amp;#x62DB;&amp;#x8FDB;&amp;#x6765;&amp;#x8981;&amp;#x8BA9;&amp;#x4F60;&amp;#x505A;Java&amp;#x6216;&amp;#x8005;.net&amp;#x5F00;&amp;#x">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'Author'
    }
  };
</script>

  <title> 是什么让我放弃了Java走向iOS开发 | moexcept </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="en">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">moexcept</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">唯有苦，方有甜。唯有累，方有闲</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            Home
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            Categories
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            Archives
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            Tags
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                是什么让我放弃了Java走向iOS开发
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">Posted on</span>
            <time itemprop="dateCreated" datetime="2015-11-29T15:53:49+08:00" content="2015-11-29">
              2015-11-29
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">In</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/感悟人生/" itemprop="url" rel="index">
                    <span itemprop="name">感悟人生</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2015/11/29/what-let-me-abandon-Java-turn-to-iOS/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2015/11/29/what-let-me-abandon-Java-turn-to-iOS/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <ul>
<li><strong>&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x505A;iOS&#x5F00;&#x53D1;&#xFF1F;</strong></li>
<li><strong>&#x5982;&#x679C;&#x628A;&#x4F60;&#x62DB;&#x8FDB;&#x6765;&#x8981;&#x8BA9;&#x4F60;&#x505A;Java&#x6216;&#x8005;.net&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4F60;&#x6765;&#x5417;&#xFF1F;</strong></li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x6211;&#x9762;&#x8BD5;&#x4E2D;&#x9762;&#x8BD5;&#x5B98;&#x6216;&#x8005;HR&#x5FC5;&#x95EE;&#x6211;&#x7684;&#x95EE;&#x9898;&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x9996;&#x5148;&#x7B80;&#x5355;&#x8BF4;&#x4E00;&#x4E0B;&#x6211;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x76EE;&#x524D;&#x5927;&#x56DB;&#x5B66;&#x751F;&#xFF0C;&#x6211;&#x662F;&#x5927;&#x4E8C;&#x5F00;&#x59CB;&#x81EA;&#x5B66;Java&#xFF0C;&#x7136;&#x540E;&#x5927;&#x4E09;&#x4E0B;&#x5B66;&#x671F;&#x653E;&#x5F03;&#x4E86;Java&#xFF0C;&#x6539;&#x53BB;&#x81EA;&#x5B66;iOS&#x5F00;&#x53D1;&#x4E86;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x81EA;&#x5B66;&#xFF1F;&#x56E0;&#x4E3A;&#x5B66;&#x6821;&#x6559;&#x7684;&#x6C34;&#x3002;</p>
<a id="more"></a>
<p>&#x5173;&#x4E8E;&#x6211;&#x7684;&#x4E00;&#x4E9B;&#x5C0F;&#x5C0F;&#x5386;&#x7A0B;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x770B;&#x4E00;&#x4E0B;&#x6211;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x60F3;&#x4E00;&#x5B9A;&#x4F1A;&#x5BF9;&#x73B0;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x8FF7;&#x832B;&#x7684;&#x4F60;&#x6709;&#x4E9B;&#x5E2E;&#x52A9;&#x7684;<a href="http://blog.csdn.net/ttf1993/article/details/40454207" target="_blank" rel="external">http://blog.csdn.net/ttf1993/article/details/40454207</a>  &#x73B0;&#x5728;&#x6211;&#x6709;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6700;&#x65B0;&#x535A;&#x5BA2;&#xFF0C;&#x8BF7;&#x5927;&#x5BB6;&#x591A;&#x591A;&#x5173;&#x6CE8; <a href="http://www.codertian.com" target="_blank" rel="external">http://www.codertian.com</a></p>
<p>&#x7B49;&#x8FC7;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x4F1A;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x6211;&#x5927;&#x5B66;&#x600E;&#x4E48;&#x4ECE;&#x4E00;&#x4E2A;&#x201C;&#x5927;&#x4E00;&#x7ED3;&#x675F;&#x8FDE;&#x7ED3;&#x6784;&#x4F53;&#x90FD;&#x4E0D;&#x61C2;&#x7684;&#x83DC;&#x9E1F;&#x201D;&#x505A;&#x5230;&#x522B;&#x4EBA;&#x773C;&#x4E2D;&#x7684;&#x201C;&#x5927;&#x795E;&#x201D;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x62FF;&#x5230;&#x5168;&#x4E13;&#x4E1A;&#x85AA;&#x8D44;top1&#x7684;&#x8DEF;&#x7A0B;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x5199;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6FC0;&#x52B1;&#x4E00;&#x4E0B;&#x5B66;&#x5F1F;&#x5B66;&#x59B9;&#x548C;&#x81EA;&#x5B66;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#xFF01;</p>
<h1 id="&#x9996;&#x5148;&#x56DE;&#x7B54;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;"><a href="#&#x9996;&#x5148;&#x56DE;&#x7B54;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;" class="headerlink" title="&#x9996;&#x5148;&#x56DE;&#x7B54;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;"></a>&#x9996;&#x5148;&#x56DE;&#x7B54;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;</h1><h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x505A;iOS&#x5F00;&#x53D1;&#xFF1F;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x505A;iOS&#x5F00;&#x53D1;&#xFF1F;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x505A;iOS&#x5F00;&#x53D1;&#xFF1F;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8981;&#x505A;iOS&#x5F00;&#x53D1;&#xFF1F;</h3><p>&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x505A;iOS&#x5F00;&#x53D1;&#xFF1F;&#x56E0;&#x4E3A;cool&#xFF01;&#xFF01;&#x6211;&#x60F3;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x6709;&#x8FD9;&#x4E48;&#x60F3;&#x5427;&#xFF0C;&#x505A;&#x5F00;&#x53D1;&#x62FF;&#x7740;&#x82F9;&#x679C;&#x7535;&#x8111;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x903C;&#x683C;&#x6EE1;&#x6EE1;&#x554A;&#xFF1F;&#x4EC0;&#x4E48;&#x80AF;&#x5FB7;&#x57FA;&#xFF0C;&#x661F;&#x5DF4;&#x514B;&#xFF0C;&#x767D;&#x5BAB;&#x554A;&#xFF01;&#xFF01;&#x6211;&#x53EA;&#x77E5;&#x9053;&#x201C;<strong>Mac&#x5728;&#x624B;&#xFF0C;&#x5929;&#x4E0B;&#x6211;&#x6709;&#x3002;&#x65E0;&#x8BBA;&#x4F55;&#x5730;&#xFF0C;&#x968F;&#x610F;&#x53BB;&#x7559;</strong>&#x201D;&#xFF01;&#x54C8;&#x54C8;&#x1F648;&#x1F648;&#x1F648;&#x1F648;&#x624B;&#x62FF;Mac&#x662F;&#x4E0D;&#x662F;coding&#x7684;&#x65F6;&#x5019;&#x611F;&#x89C9;&#x6574;&#x4E2A;&#x4EBA;&#x90FD;&#x7CBE;&#x795E;&#x4E86;&#xFF1F;&#x66F4;&#x6709;&#x81EA;&#x4FE1;&#x4E86;&#xFF1F;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#xFF1F;</p>
<p>&#x54C8;&#x54C8;&#xFF0C;&#x5F00;&#x4E2A;&#x73A9;&#x7B11;</p>
<p><strong>&#x5176;&#x5B9E;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x60F3;&#x505A;iOS&#x5F00;&#x53D1;&#x6709;&#x51E0;&#x4E2A;&#x601D;&#x8003;&#x70B9;&#xFF0C;&#x624D;&#x4FC3;&#x4F7F;&#x6211;&#x53BB;&#x505A;&#x4E86;&#xFF0C;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4E5F;&#x66F4;&#x52A0;&#x6709;&#x4FE1;&#x5FC3;&#x76F8;&#x4FE1;&#x6211;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5BF9;&#x7684;&#x3002;</strong></p>
<ol>
<li><p>&#x4E00;&#x76F4;&#x611F;&#x89C9;&#x82F9;&#x679C;&#x5F00;&#x53D1;&#x5F88;&#x795E;&#x79D8;&#xFF0C;&#x611F;&#x89C9;OC&#x5F88;&#x795E;&#x79D8;&#xFF0C;&#x4E5F;&#x6FC0;&#x53D1;&#x4E86;&#x6211;&#x5F88;&#x5927;&#x7684;&#x5B66;&#x4E60;&#x6FC0;&#x60C5;&#x3002;&#x665A;&#x4E0A;&#x505A;&#x68A6;&#x90FD;&#x68A6;&#x5230;&#x4E54;&#x5E03;&#x65AF;&#x8BA9;&#x6211;&#x505A;iOS(&#x5F53;&#x7136;&#x5047;&#x7684;)</p>
</li>
<li><p>&#x5F53;&#x65F6;&#x6211;&#x624B;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x4E8C;&#x624B;iPhone5&#xFF0C;&#x81EA;&#x4ECE;&#x7528;&#x4E86;&#x82F9;&#x679C;&#x771F;&#x7684;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5F88;&#x5FEB;&#x4F1A;&#x7231;&#x4E0A;&#x82F9;&#x679C;&#xFF0C;&#x5F88;&#x60F3;&#x4E3A;&#x4ED6;&#x5F00;&#x53D1;&#x4E00;&#x6B3E;&#x81EA;&#x5DF1;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x7528;&#x4E0A;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6210;&#x5C31;&#x611F;&#xFF1F;&#xFF1F;</p>
</li>
<li><p>&#x505A;&#x7F51;&#x9875;&#x540E;&#x7AEF;&#xFF0C;&#x54EA;&#x6709;&#x505A;&#x79FB;&#x52A8;&#x7AEF;&#x597D;&#x73A9;&#xFF1F;&#x73B0;&#x5728;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x901A;&#x8FC7;&#x7535;&#x8111;&#x6D4F;&#x89C8;&#x7F51;&#x7AD9;&#x554A;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x624B;&#x673A;&#x5427;&#xFF0C;&#x540E;&#x7AEF;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x8DDF;&#x4E00;&#x822C;&#x4EBA;&#x8BF4;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x5565;&#xFF0C;&#x800C;App&#x5C31;&#x4E0D;&#x540C;&#x4E86;&#xFF0C;&#x4E16;&#x4EBA;&#x7686;&#x77E5;&#x554A;&#xFF01;&#x542C;&#x8D77;&#x6765;&#x5C31;&#x9AD8;&#x5927;&#x4E0A;&#x554A;&#x1F601;&#x1F601;</p>
</li>
<li><p>&#x626F;&#x8FDC;&#x70B9;&#xFF0C;&#x7EB5;&#x89C2;&#x672A;&#x6765;&#x5341;&#x5E74;&#xFF0C;&#x6211;&#x60F3;&#x5E94;&#x8BE5;&#x662F;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5929;&#x4E0B;&#x5427;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x4E00;&#x5B9A;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x7684;&#xFF01;&#x4E00;&#x5B9A;&#x4F1A;&#x6210;&#x4E3A;&#x516C;&#x53F8;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x5230;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x662F;&#x516C;&#x53F8;&#x5FC5;&#x4E89;&#x7684;&#x4EBA;&#x624D;&#xFF01;&#xFF01;</p>
</li>
</ol>
<p>&#x51FA;&#x4E8E;&#x8FD9;&#x51E0;&#x70B9;&#xFF0C;&#x6211;&#x5927;&#x4E09;&#x6691;&#x5047;&#x539A;&#x7740;&#x8138;&#x76AE;&#x8DDF;&#x6211;&#x5988;&#x501F;&#x4E86;&#x70B9;&#x94B1;&#x53BB;&#x6DD8;&#x5B9D;&#x4E8C;&#x624B;&#x4E0A;&#x4E70;&#x4E86;&#x4E2A;&#x4E8C;&#x624B;&#x7684;MacBook&#x3002;&#x7B49;&#x6211;&#x624B;&#x5934;&#x7535;&#x8111;&#x5356;&#x4E86;&#xFF0C;&#x518D;&#x628A;&#x94B1;&#x8FD8;&#x7ED9;&#x5979;&#xFF08;&#x540E;&#x6765;&#x7535;&#x8111;&#x4E5F;&#x6CA1;&#x6709;&#x5356;&#x51FA;&#x53BB;&#x1F602;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5931;&#x53BB;windows&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x4E0D;&#x65B9;&#x4FBF;&#xFF09;</p>
<p><strong>&#x81EA;&#x5B66;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x575A;&#x4FE1;&#x6211;&#x7684;&#x9009;&#x62E9;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1F;</strong></p>
<ol>
<li><p>&#x5728;&#x6211;&#x5B66;JavaEE&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x67E5;&#x770B;&#x82F1;&#x6587;&#x6587;&#x6863;&#xFF0C;&#x56E0;&#x4E3A;Java&#x6280;&#x672F;&#x53D1;&#x5C55;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x6280;&#x672F;&#x90FD;&#x5DF2;&#x7ECF;&#x6C89;&#x6DC0;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x4E2D;&#x6587;&#x767E;&#x5EA6;&#x90FD;&#x80FD;&#x627E;&#x5F97;&#x5230;&#x3002;&#x4F60;&#x6839;&#x672C;&#x65E0;&#x9700;&#x53BB;&#x627E;&#x82F1;&#x6587;&#x7684;&#x3002;&#x4F46;&#x5728;&#x6211;&#x81EA;&#x5B66;iOS&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x8981;&#x4E0D;&#x505C;&#x53BB;&#x770B;&#x82F1;&#x6587;&#x6587;&#x6863;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x6CA1;&#x6709;&#x4E2D;&#x6587;&#x89E3;&#x91CA;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x903C;&#x8FEB;&#x81EA;&#x5DF1;&#x53BB;&#x770B;&#x82F1;&#x6587;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x81EA;&#x5DF1;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x4E60;&#x60EF;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6211;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x7684;&#x82F1;&#x6587;&#x6C34;&#x5E73;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x597D;&#x591A;&#x3002;</p>
</li>
<li><p>&#x5B66;Java&#x90A3;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#x6211;&#x4E0D;&#x77E5;&#x9053;github&#xFF0C;&#x4E0D;&#x77E5;&#x9053;stackoverflow&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x7B80;&#x4E66;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x901B;&#x725B;&#x4EBA;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x54CE;&#x3002;&#x1F62D;&#x1F62D;&#x1F62D;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x5B66;&#x4E86;iOS&#x5F00;&#x53D1;&#xFF01;&#x6211;&#x5B66;&#x4E86;iOS&#x5F00;&#x53D1;&#xFF01;&#x6211;&#x5B66;&#x4E86;iOS&#x5F00;&#x53D1;&#xFF01;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x8BF4;&#x4E09;&#x904D;&#x3002;&#x6211;&#x90FD;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x90FD;&#x7528;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x6536;&#x85CF;&#x4E86;&#x5F88;&#x591A;&#x5927;&#x795E;&#x7684;&#x535A;&#x5BA2;&#x3002;&#x6211;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x901B;&#x82F1;&#x6587;&#x7F51;&#x7AD9;&#x4E86;&#x3002;&#x8170;&#x4E5F;&#x4E0D;&#x9178;&#x4E86;&#xFF0C;&#x817F;&#x4E5F;&#x4E0D;&#x75BC;&#x4E86;&#xFF0C;&#x5E72;&#x4EC0;&#x4E48;&#x90FD;&#x6709;&#x7CBE;&#x795E;&#x4E86;&#xFF01;&#xFF01;&#x603B;&#x4E4B;iOS&#x5F00;&#x53D1;&#x8BA9;&#x6211;&#x91CD;&#x632F;&#x7537;&#x4EBA;&#x96C4;&#x98CE;&#xFF01;&#xFF01;</p>
</li>
<li><p>&#x5B66;iOS&#x5F00;&#x53D1;&#xFF0C;&#x4F60;&#x5C31;&#x8981;&#x7528;Mac&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x63A5;&#x89E6;&#x4E86;Mac&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;coding&#x662F;&#x4E00;&#x4EF6;&#x591A;&#x4E48;&#x5FEB;&#x4E50;&#x7684;&#x4E8B;&#x554A;&#xFF0C;&#x90A3;&#x4EE3;&#x7801;&#x5B57;&#x4F53;&#x663E;&#x793A;&#xFF01;&#x90A3;&#x4EE3;&#x7801;&#x7684;&#x989C;&#x8272;&#xFF01;&#x90A3;&#x952E;&#x76D8;&#x7684;&#x624B;&#x611F;&#xFF01;&#x90A3;&#x5C4F;&#x5E55;&#x7684;&#x663E;&#x793A;&#xFF01;&#x91CD;&#x8981;&#x7684;&#x662F;UNIX&#x7684;&#x65B9;&#x4FBF;&#xFF01;&#xFF01;coding&#x7684;&#x65F6;&#x5019;&#x771F;&#x7684;&#x4F1A;&#x8BA9;&#x4F60;&#x50CF;&#x770B;X&#x7247;&#x4E00;&#x6837;&#x5168;&#x8EAB;&#x6FC0;&#x60C5;&#x6F8E;&#x6E43;&#xFF0C;&#x6D51;&#x8EAB;&#x5145;&#x8840;&#xFF01;&#xFF01;&#x6240;&#x4EE5;&#x6211;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#xFF0C;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x6700;&#x597D;&#x80FD;&#x6709;&#x4E00;&#x4E2A;Mac&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x63D0;&#x9AD8;&#x4F60;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#x4E50;&#x8DA3;&#xFF01;</p>
</li>
<li><p>&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x5C55;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x516C;&#x53F8;&#x5F00;&#x59CB;&#x6CE8;&#x91CD;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x3002;&#x76F8;&#x5E94;&#x7684;&#x5C97;&#x4F4D;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x7684;App&#x60F3;&#x6CD5;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x521B;&#x4E1A;&#xFF0C;&#x521B;&#x4E1A;&#x7684;&#x673A;&#x4F1A;&#x4F1A;&#x5927;&#x5F88;&#x591A;&#x3002;</p>
</li>
<li><p>&#x4F5C;&#x4E3A;&#x79D1;&#x6280;&#x524D;&#x6CBF;&#x4EBA;&#x624D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6709;&#x4E0D;&#x65AD;&#x7684;&#x65B0;&#x6280;&#x672F;&#x51FA;&#x73B0;&#x7ED9;&#x6211;&#x4EEC;&#x6CE8;&#x5C04;&#x65B0;&#x9C9C;&#x7684;&#x8840;&#x6DB2;&#xFF0C;&#x90A3;&#x4E48;&#x9009;&#x62E9;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#xFF0C;&#x4F60;&#x5C31;&#x9009;&#x5BF9;&#x4E86;&#x3002;&#x82F9;&#x679C;&#x6BCF;&#x5E74;&#x90FD;&#x4F1A;&#x53D1;&#x5E03;&#x65B0;&#x7684;SDK&#xFF0C;&#x65B0;&#x7684;&#x5F00;&#x53D1;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x5C31;&#x7ED9;&#x4F60;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#x52A8;&#x529B;&#xFF0C;&#x4E5F;&#x4F1A;&#x8BA9;&#x4F60;&#x8DB3;&#x591F;&#x7684;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x7AD9;&#x5728;&#x79D1;&#x6280;&#x7684;&#x6700;&#x9876;&#x7AEF;&#x3002;</p>
</li>
<li><p>&#x5F53;&#x7136;&#x85AA;&#x8D44;&#x4E5F;&#x662F;&#x4E00;&#x65B9;&#x9762;&#xFF0C; iOS&#x5F00;&#x53D1;&#x85AA;&#x8D44;&#x666E;&#x904D;&#x4E5F;&#x6BD4;&#x8F83;&#x9AD8;&#xFF01;&#xFF01;</p>
</li>
</ol>
<p>&#x662F;&#x4E0D;&#x662F;&#x611F;&#x89C9;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x4E0D;&#x5B66;iOS&#x5F00;&#x53D1;&#x4E86;&#xFF1F;&#x603B;&#x4E4B;&#x5B66;iOS&#x7684;&#x5F00;&#x53D1;&#x8BA9;&#x6211;&#x77E5;&#x9053;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x4E5F;&#x4E86;&#x89E3;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x5B66;Java&#x7684;&#x65F6;&#x5019;&#x6211;&#x7684;&#x76EE;&#x6807;&#x662F;&#x9A6C;&#x58EB;&#x5175;&#xFF0C;&#x97E9;&#x987A;&#x5E73;&#x4ED6;&#x4EEC;&#x3002;&#x5B66;iOS&#x65F6;&#x5019;&#x6211;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5510;&#x5DE7;&#xFF0C;&#x738B;&#x5DCD;&#xFF0C;&#x674E;&#x660E;&#x6770;&#x4ED6;&#x4EEC;&#x3002;&#x6709;&#x76EE;&#x6807;&#x624D;&#x6709;&#x5B66;&#x4E60;&#x52A8;&#x529B;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x4F60;&#x4EEC;&#x4E5F;&#x7ED9;&#x81EA;&#x5DF1;&#x6811;&#x7ACB;&#x4E2A;&#x76EE;&#x6807;&#x5427;</p>
<h1 id="&#x56DE;&#x7B54;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;"><a href="#&#x56DE;&#x7B54;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;" class="headerlink" title="&#x56DE;&#x7B54;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;"></a>&#x56DE;&#x7B54;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;</h1><h3 id="&#x5982;&#x679C;&#x628A;&#x4F60;&#x62DB;&#x8FDB;&#x6765;&#x8981;&#x8BA9;&#x4F60;&#x505A;Java&#x6216;&#x8005;-net&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4F60;&#x6765;&#x5417;&#xFF1F;"><a href="#&#x5982;&#x679C;&#x628A;&#x4F60;&#x62DB;&#x8FDB;&#x6765;&#x8981;&#x8BA9;&#x4F60;&#x505A;Java&#x6216;&#x8005;-net&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4F60;&#x6765;&#x5417;&#xFF1F;" class="headerlink" title="&#x5982;&#x679C;&#x628A;&#x4F60;&#x62DB;&#x8FDB;&#x6765;&#x8981;&#x8BA9;&#x4F60;&#x505A;Java&#x6216;&#x8005;.net&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4F60;&#x6765;&#x5417;&#xFF1F;"></a>&#x5982;&#x679C;&#x628A;&#x4F60;&#x62DB;&#x8FDB;&#x6765;&#x8981;&#x8BA9;&#x4F60;&#x505A;Java&#x6216;&#x8005;.net&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4F60;&#x6765;&#x5417;&#xFF1F;</h3><p>&#x6211;&#x7684;&#x7B54;&#x6848;&#xFF1A;&#x4E0D;&#x6765;</p>
<ol>
<li><p>&#x505A;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x548C;Java&#x5F00;&#x53D1;.net&#x5F00;&#x53D1;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;Java&#x5F00;&#x53D1;.net&#x5F00;&#x53D1;&#x8FD9;&#x4E9B;&#x4EBA;&#x624D;&#x4E00;&#x6293;&#x4E00;&#x5927;&#x628A;&#xFF0C;&#x8EAB;&#x8FB9;&#x90FD;&#x662F;&#x505A;Java&#x548C;.net&#x7684;&#xFF0C;&#x6211;&#x60F3;&#x8BA9;&#x81EA;&#x5DF1;&#x7279;&#x522B;&#x4E00;&#x70B9;&#xFF0C;&#x4E5F;&#x60F3;&#x8DDF;&#x968F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x53BB;&#x505A;&#x4E8B;&#xFF01;&#x6211;&#x4E0D;&#x60F3;&#x4E3A;&#x4E86;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x533A;&#x59A5;&#x534F;&#x81EA;&#x5DF1;&#x7406;&#x60F3;&#x3002;</p>
</li>
<li><p>&#x6211;&#x81EA;&#x5B66;&#x8FC7;&#x633A;&#x591A;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4EC0;&#x4E48;C&#xFF0C;C++&#xFF0C;Java&#xFF0C;JS&#xFF0C;C#&#x7B49;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5B66;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x4E1C;&#x897F;&#x6211;&#x4E0D;&#x6562;&#x8BF4;&#x6211;&#x7CBE;&#x901A;&#x54EA;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF01;&#x8FD9;&#x5C31;&#x662F;&#x5E7F;&#xFF0C;&#x7136;&#x800C;&#x4F01;&#x4E1A;&#x6700;&#x4E0D;&#x559C;&#x6B22;&#x7684;&#x5C31;&#x662F;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x4F1A;&#xFF0C;&#x800C;&#x4EC0;&#x4E48;&#x90FD;&#x505A;&#x4E0D;&#x597D;&#x3002;&#x6211;&#x5403;&#x8FC7;&#x5E7F;&#x7684;&#x6ECB;&#x5473;&#xFF0C;&#x6211;&#x4E0D;&#x8981;&#x201C;&#x5E7F;&#x800C;&#x4E0D;&#x7CBE;&#x201D;&#xFF0C;&#x6211;&#x53EA;&#x8981;&#x7CBE;&#xFF01;&#xFF01;&#x6211;&#x9009;&#x62E9;&#x5148;&#x7CBE;&#x901A;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x518D;&#x53BB;&#x5E7F;&#x6CDB;&#x63A5;&#x89E6;&#x5176;&#x4ED6;&#x65B9;&#x5411;&#x3002;&#x73B0;&#x5728;&#x6211;&#x65E2;&#x7136;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x6761;&#x6211;&#x8BA4;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x5C31;&#x7B97;&#x4E0D;&#x7ED9;&#x6211;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x613F;&#x610F;&#x6539;&#x53D8;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x89C4;&#x5212;&#x3002;&#x6211;&#x53EA;&#x60F3;&#x5728;&#x6211;&#x559C;&#x6B22;&#x7684;&#x8FD9;&#x6761;&#x8DEF;&#x8D70;&#x7CBE;&#x800C;&#x540E;&#x5E7F;&#xFF01;&#xFF01;</p>
</li>
</ol>
<p>&#x6211;&#x4EEC;&#x5B66;&#x6821;&#x62DB;&#x8058;iOS&#x5C97;&#x4F4D;&#x5F88;&#x5C11;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x9762;&#x8BD5;&#x673A;&#x4F1A;&#x4E5F;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x540E;&#x6094;&#x8FC7;&#x6211;&#x9009;&#x62E9;&#x8FD9;&#x6761;&#x8DEF;&#xFF01;&#xFF01;</p>
<p>&#x6240;&#x4EE5;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#xFF0C;&#x9009;&#x597D;&#x81EA;&#x5DF1;&#x8DEF;&#xFF0C;&#x4E0D;&#x8BBA;&#x4F60;&#x662F;&#x671D;&#x7740;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#x52AA;&#x529B;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x6700;&#x521D;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;&#xFF0C;&#x5C3D;&#x91CF;&#x505A;&#x5230;&#x4E0D;&#x4E3A;&#x751F;&#x6D3B;&#x7F81;&#x7ECA;&#xFF0C;&#x671D;&#x7740;&#x4EBA;&#x751F;&#x7406;&#x60F3;&#x594B;&#x6597;&#xFF01;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/iOS/" rel="tag">#iOS</a>
          
            <a href="/tags/感悟人生/" rel="tag">#感悟人生</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/11/26/use-autolayout-dynamic-cell/" rel="next" title="使用Autolayout创建动态cell">
                <i class="fa fa-chevron-left"></i> 使用Autolayout创建动态cell
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/12/01/zhaopinmaimorencai/" rel="prev" title="简单的招聘方式错过了多少人才知道吗">
                简单的招聘方式错过了多少人才知道吗 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2015/11/29/what-let-me-abandon-Java-turn-to-iOS/"
           data-title="是什么让我放弃了Java走向iOS开发" data-url="http://codertian.com/2015/11/29/what-let-me-abandon-Java-turn-to-iOS/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            Overview
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="John Doe" />
          <p class="site-author-name" itemprop="name">John Doe</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">posts</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">categories</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">tags</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#首先回答第一个问题"><span class="nav-number">1.</span> <span class="nav-text">首先回答第一个问题</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#为什么你要做iOS开发？"><span class="nav-number">1.0.1.</span> <span class="nav-text">为什么你要做iOS开发？</span></a></li></ol></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#回答第二个问题"><span class="nav-number">2.</span> <span class="nav-text">回答第二个问题</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#如果把你招进来要让你做Java或者-net开发工作你来吗？"><span class="nav-number">2.0.1.</span> <span class="nav-text">如果把你招进来要让你做Java或者.net开发工作你来吗？</span></a></li></ol></li></ol></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">John Doe</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="theme-info">
  Theme -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"moexcept"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
